'''
Python Basic Lesson 07, Exercise 01

Реализовать класс Stationery (канцелярская принадлежность). Определить в н
ем атрибут title (название)
и метод draw (отрисовка). Метод выводит сообщение “Запуск отрисовки.” Создать три дочерних класса Pen (ручка),
Pencil (карандаш), Handle (маркер). В каждом из классов реализовать переопределение метода draw.
Для каждого из классов методы должен выводить уникальное сообщение. Создать экземпляры классов и проверить,
что выведет описанный метод для каждого экземпляра.

20191028 Sikorskiy Yuriy
cs.yury.v@pm.me

'''